benchmarks/results/pairs/nextjs/nextjs-list-1.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * list: 50 looping VUs for 30s (exec: list, gracefulStop: 10s)


running (01.0s), 50/50 VUs, 228 complete and 0 interrupted iterations
list   [   3% ] 50 VUs  01.0s/30s

running (02.0s), 50/50 VUs, 478 complete and 0 interrupted iterations
list   [   7% ] 50 VUs  02.0s/30s

running (03.0s), 50/50 VUs, 705 complete and 0 interrupted iterations
list   [  10% ] 50 VUs  03.0s/30s

running (04.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
list   [  13% ] 50 VUs  04.0s/30s

running (05.0s), 50/50 VUs, 1176 complete and 0 interrupted iterations
list   [  17% ] 50 VUs  05.0s/30s

running (06.0s), 50/50 VUs, 1406 complete and 0 interrupted iterations
list   [  20% ] 50 VUs  06.0s/30s

running (07.0s), 50/50 VUs, 1680 complete and 0 interrupted iterations
list   [  23% ] 50 VUs  07.0s/30s

running (08.0s), 50/50 VUs, 1965 complete and 0 interrupted iterations
list   [  27% ] 50 VUs  08.0s/30s

running (09.0s), 50/50 VUs, 2221 complete and 0 interrupted iterations
list   [  30% ] 50 VUs  09.0s/30s

running (10.0s), 50/50 VUs, 2489 complete and 0 interrupted iterations
list   [  33% ] 50 VUs  10.0s/30s

running (11.0s), 50/50 VUs, 2762 complete and 0 interrupted iterations
list   [  37% ] 50 VUs  11.0s/30s

running (12.0s), 50/50 VUs, 3031 complete and 0 interrupted iterations
list   [  40% ] 50 VUs  12.0s/30s

running (13.0s), 50/50 VUs, 3321 complete and 0 interrupted iterations
list   [  43% ] 50 VUs  13.0s/30s

running (14.0s), 50/50 VUs, 3600 complete and 0 interrupted iterations
list   [  47% ] 50 VUs  14.0s/30s

running (15.0s), 50/50 VUs, 3869 complete and 0 interrupted iterations
list   [  50% ] 50 VUs  15.0s/30s

running (16.0s), 50/50 VUs, 4144 complete and 0 interrupted iterations
list   [  53% ] 50 VUs  16.0s/30s

running (17.0s), 50/50 VUs, 4359 complete and 0 interrupted iterations
list   [  57% ] 50 VUs  17.0s/30s

running (18.0s), 50/50 VUs, 4557 complete and 0 interrupted iterations
list   [  60% ] 50 VUs  18.0s/30s

running (19.0s), 50/50 VUs, 4791 complete and 0 interrupted iterations
list   [  63% ] 50 VUs  19.0s/30s

running (20.0s), 50/50 VUs, 5038 complete and 0 interrupted iterations
list   [  67% ] 50 VUs  20.0s/30s

running (21.0s), 50/50 VUs, 5326 complete and 0 interrupted iterations
list   [  70% ] 50 VUs  21.0s/30s

running (22.0s), 50/50 VUs, 5648 complete and 0 interrupted iterations
list   [  73% ] 50 VUs  22.0s/30s

running (23.0s), 50/50 VUs, 5812 complete and 0 interrupted iterations
list   [  77% ] 50 VUs  23.0s/30s

running (24.0s), 50/50 VUs, 6064 complete and 0 interrupted iterations
list   [  80% ] 50 VUs  24.0s/30s

running (25.0s), 50/50 VUs, 6330 complete and 0 interrupted iterations
list   [  83% ] 50 VUs  25.0s/30s

running (26.0s), 50/50 VUs, 6487 complete and 0 interrupted iterations
list   [  87% ] 50 VUs  26.0s/30s

running (27.0s), 50/50 VUs, 6695 complete and 0 interrupted iterations
list   [  90% ] 50 VUs  27.0s/30s

running (28.0s), 50/50 VUs, 6949 complete and 0 interrupted iterations
list   [  93% ] 50 VUs  28.0s/30s

running (29.0s), 50/50 VUs, 7171 complete and 0 interrupted iterations
list   [  97% ] 50 VUs  29.0s/30s

running (30.0s), 50/50 VUs, 7392 complete and 0 interrupted iterations
list   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 14884   493.665823/s
    checks_succeeded...: 100.00% 14884 out of 14884
    checks_failed......: 0.00%   0 out of 14884

    ✓ status ok
    ✓ has data

    CUSTOM
    failed_requests................: 0.00%  0 out of 7442
    ttfb...........................: avg=200.67ms min=22.2ms  med=188.98ms max=773.17ms p(90)=282.73ms p(95)=317.06ms

    HTTP
    http_req_duration..............: avg=201.66ms min=22.74ms med=189.65ms max=773.57ms p(90)=284.13ms p(95)=318.86ms
      { expected_response:true }...: avg=201.66ms min=22.74ms med=189.65ms max=773.57ms p(90)=284.13ms p(95)=318.86ms
    http_req_failed................: 0.00%  0 out of 7442
    http_reqs......................: 7442   246.832912/s

    EXECUTION
    iteration_duration.............: avg=202.09ms min=26.93ms med=190.04ms max=773.99ms p(90)=284.52ms p(95)=319.34ms
    iterations.....................: 7442   246.832912/s
    vus............................: 50     min=50        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 46 MB  1.5 MB/s
    data_sent......................: 1.2 MB 40 kB/s



running (30.1s), 00/50 VUs, 7442 complete and 0 interrupted iterations
list ✓ [ 100% ] 50 VUs  30s