benchmarks/results/pairs/nextjs/nextjs-list-2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * list: 50 looping VUs for 30s (exec: list, gracefulStop: 10s)


running (01.0s), 50/50 VUs, 131 complete and 0 interrupted iterations
list   [   3% ] 50 VUs  01.0s/30s

running (02.0s), 50/50 VUs, 263 complete and 0 interrupted iterations
list   [   7% ] 50 VUs  02.0s/30s

running (03.0s), 50/50 VUs, 402 complete and 0 interrupted iterations
list   [  10% ] 50 VUs  03.0s/30s

running (04.0s), 50/50 VUs, 576 complete and 0 interrupted iterations
list   [  13% ] 50 VUs  04.0s/30s

running (05.0s), 50/50 VUs, 713 complete and 0 interrupted iterations
list   [  17% ] 50 VUs  05.0s/30s

running (06.0s), 50/50 VUs, 855 complete and 0 interrupted iterations
list   [  20% ] 50 VUs  06.0s/30s

running (07.0s), 50/50 VUs, 1017 complete and 0 interrupted iterations
list   [  23% ] 50 VUs  07.0s/30s

running (08.0s), 50/50 VUs, 1125 complete and 0 interrupted iterations
list   [  27% ] 50 VUs  08.0s/30s

running (09.0s), 50/50 VUs, 1256 complete and 0 interrupted iterations
list   [  30% ] 50 VUs  09.0s/30s

running (10.0s), 50/50 VUs, 1406 complete and 0 interrupted iterations
list   [  33% ] 50 VUs  10.0s/30s

running (11.0s), 50/50 VUs, 1558 complete and 0 interrupted iterations
list   [  37% ] 50 VUs  11.0s/30s

running (12.0s), 50/50 VUs, 1676 complete and 0 interrupted iterations
list   [  40% ] 50 VUs  12.0s/30s

running (13.0s), 50/50 VUs, 1803 complete and 0 interrupted iterations
list   [  43% ] 50 VUs  13.0s/30s

running (14.0s), 50/50 VUs, 1905 complete and 0 interrupted iterations
list   [  47% ] 50 VUs  14.0s/30s

running (15.0s), 50/50 VUs, 2042 complete and 0 interrupted iterations
list   [  50% ] 50 VUs  15.0s/30s

running (16.0s), 50/50 VUs, 2222 complete and 0 interrupted iterations
list   [  53% ] 50 VUs  16.0s/30s

running (17.0s), 50/50 VUs, 2396 complete and 0 interrupted iterations
list   [  57% ] 50 VUs  17.0s/30s

running (18.0s), 50/50 VUs, 2627 complete and 0 interrupted iterations
list   [  60% ] 50 VUs  18.0s/30s

running (19.0s), 50/50 VUs, 2836 complete and 0 interrupted iterations
list   [  63% ] 50 VUs  19.0s/30s

running (20.0s), 50/50 VUs, 3092 complete and 0 interrupted iterations
list   [  67% ] 50 VUs  20.0s/30s

running (21.0s), 50/50 VUs, 3331 complete and 0 interrupted iterations
list   [  70% ] 50 VUs  21.0s/30s

running (22.0s), 50/50 VUs, 3610 complete and 0 interrupted iterations
list   [  73% ] 50 VUs  22.0s/30s

running (23.0s), 50/50 VUs, 3903 complete and 0 interrupted iterations
list   [  77% ] 50 VUs  23.0s/30s

running (24.0s), 50/50 VUs, 4214 complete and 0 interrupted iterations
list   [  80% ] 50 VUs  24.0s/30s

running (25.0s), 50/50 VUs, 4504 complete and 0 interrupted iterations
list   [  83% ] 50 VUs  25.0s/30s

running (26.0s), 50/50 VUs, 4733 complete and 0 interrupted iterations
list   [  87% ] 50 VUs  26.0s/30s

running (27.0s), 50/50 VUs, 4986 complete and 0 interrupted iterations
list   [  90% ] 50 VUs  27.0s/30s

running (28.0s), 50/50 VUs, 5262 complete and 0 interrupted iterations
list   [  93% ] 50 VUs  28.0s/30s

running (29.0s), 50/50 VUs, 5549 complete and 0 interrupted iterations
list   [  97% ] 50 VUs  29.0s/30s

running (30.0s), 50/50 VUs, 5821 complete and 0 interrupted iterations
list   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 11756   390.699496/s
    checks_succeeded...: 100.00% 11756 out of 11756
    checks_failed......: 0.00%   0 out of 11756

    ✓ status ok
    ✓ has data

    CUSTOM
    failed_requests................: 0.00%  0 out of 5878
    ttfb...........................: avg=253.61ms min=33.67ms med=211.92ms max=1.23s p(90)=400.98ms p(95)=463.94ms

    HTTP
    http_req_duration..............: avg=255.07ms min=34.72ms med=212.66ms max=1.23s p(90)=402.1ms  p(95)=467.24ms
      { expected_response:true }...: avg=255.07ms min=34.72ms med=212.66ms max=1.23s p(90)=402.1ms  p(95)=467.24ms
    http_req_failed................: 0.00%  0 out of 5878
    http_reqs......................: 5878   195.349748/s

    EXECUTION
    iteration_duration.............: avg=255.64ms min=44.83ms med=213.09ms max=1.24s p(90)=403ms    p(95)=467.68ms
    iterations.....................: 5878   195.349748/s
    vus............................: 50     min=50        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 36 MB  1.2 MB/s
    data_sent......................: 945 kB 31 kB/s



running (30.1s), 00/50 VUs, 5878 complete and 0 interrupted iterations
list ✓ [ 100% ] 50 VUs  30s